balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1902.PIC
        <edc:AdjustPoint edc:offset="5"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="1" edc:beginaddr="0x80" edc:endaddr="0xA0" edc:regionid="sfr1">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISA" edc:desc="PORTA Data Direction Control Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISA" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA3" edc:desc="" edc:mask="0x1" edc:name="TRISA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA5" edc:desc="" edc:mask="0x1" edc:name="TRISA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA6" edc:desc="" edc:mask="0x1" edc:name="TRISA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA7" edc:desc="" edc:mask="0x1" edc:name="TRISA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISA" edc:desc="" edc:mask="0xff" edc:name="TRISA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISB" edc:desc="PORTB Data Direction Control Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISB" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISB0" edc:desc="" edc:mask="0x1" edc:name="TRISB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB1" edc:desc="" edc:mask="0x1" edc:name="TRISB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB2" edc:desc="" edc:mask="0x1" edc:name="TRISB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB3" edc:desc="" edc:mask="0x1" edc:name="TRISB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB6" edc:desc="" edc:mask="0x1" edc:name="TRISB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISB" edc:desc="" edc:mask="0xff" edc:name="TRISB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISC" edc:desc="PORTC Data Direction Control Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISC" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISC0" edc:desc="" edc:mask="0x1" edc:name="TRISC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC1" edc:desc="" edc:mask="0x1" edc:name="TRISC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC2" edc:desc="" edc:mask="0x1" edc:name="TRISC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC3" edc:desc="" edc:mask="0x1" edc:name="TRISC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC4" edc:desc="" edc:mask="0x1" edc:name="TRISC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC5" edc:desc="" edc:mask="0x1" edc:name="TRISC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC6" edc:desc="" edc:mask="0x1" edc:name="TRISC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC7" edc:desc="" edc:mask="0x1" edc:name="TRISC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISC" edc:desc="" edc:mask="0xff" edc:name="TRISC" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="--------" edc:cname="TRISE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----1---" edc:name="TRISE" edc:nzwidth="0x8" edc:por="----1---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISE" edc:desc="" edc:mask="0xff" edc:name="TRISE" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-----n" edc:cname="PIE1" edc:desc="Peripheral Interrupt Enable Register 1" edc:impl="0xc1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-----0" edc:name="PIE1" edc:nzwidth="0x8" edc:por="00-----0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IE" edc:desc="TMR1 Overflow Interrupt Enable bit" edc:mask="0x1" edc:name="TMR1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADIE" edc:desc="A/D Converter Interrupt Enable bit" edc:mask="0x1" edc:name="ADIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIE" edc:desc="Timer1 Gate Interrupt Enable bit" edc:mask="0x1" edc:name="TMR1GIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---n-n--" edc:cname="PIE2" edc:desc="Peripheral Interrupt Enable Register 2" edc:impl="0x14" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0-0--" edc:name="PIE2" edc:nzwidth="0x8" edc:por="---0-0--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LCDIE" edc:desc="LCD Module Interrupt Enable bit" edc:mask="0x1" edc:name="LCDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EEIE" edc:desc="EEPROM Write Completion Interrupt Enable bit" edc:mask="0x1" edc:name="EEIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPTION_REG" edc:desc="Option Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="OPTION_REG" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PS0" edc:desc="Prescaler Rate Select bits" edc:mask="0x1" edc:name="PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:desc="Prescaler Rate Select bits" edc:mask="0x1" edc:name="PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:desc="Prescaler Rate Select bits" edc:mask="0x1" edc:name="PS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSA" edc:desc="Prescaler Active bit" edc:mask="0x1" edc:name="PSA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0SE" edc:desc="TMR0 Source Edge Select bit" edc:mask="0x1" edc:name="TMR0SE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0CS" edc:desc="TMR0 Clock Source Select bit" edc:mask="0x1" edc:name="TMR0CS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTEDG" edc:desc="Interrupt Edge Select bit" edc:mask="0x1" edc:name="INTEDG" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nWPUEN" edc:desc="Weak Pull-up Enable bit" edc:mask="0x1" edc:name="nWPUEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PS" edc:desc="Prescaler Rate Select bits" edc:mask="0x7" edc:name="PS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T0SE" edc:desc="" edc:mask="0x1" edc:name="T0SE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CS" edc:desc="" edc:mask="0x1" edc:name="T0CS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="PCON" edc:desc="Power Control Register" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qq-qqquu" edc:name="PCON" edc:nzwidth="0x8" edc:por="00-111qq">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="nBOR" edc:desc="Brown-out Reset Status bit" edc:mask="0x1" edc:name="nBOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nPOR" edc:desc="Power-on Reset Status bit" edc:mask="0x1" edc:name="nPOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nRI" edc:desc="RESET Instruction Flag bit" edc:mask="0x1" edc:name="nRI" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="nRMCLR" edc:desc="MCLR Reset Flag bit" edc:mask="0x1" edc:name="nRMCLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="nRWDT" edc:desc="" edc:mask="0x1" edc:name="nRWDT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="STKUNF" edc:desc="Stack Underflow Flag bit" edc:mask="0x1" edc:name="STKUNF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STKOVF" edc:desc="Stack Overflow Flag bit" edc:mask="0x1" edc:name="STKOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="WDTCON" edc:desc="Watchdog Timer Control Register" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--010110" edc:name="WDTCON" edc:nzwidth="0x8" edc:por="--010110">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="Software Enable/Disable for Watch Dog Timer bit" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WDTPS0" edc:desc="Watchdog Timer Period Select bits" edc:mask="0x1" edc:name="WDTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS1" edc:desc="Watchdog Timer Period Select bits" edc:mask="0x1" edc:name="WDTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS2" edc:desc="Watchdog Timer Period Select bits" edc:mask="0x1" edc:name="WDTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS3" edc:desc="Watchdog Timer Period Select bits" edc:mask="0x1" edc:name="WDTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS4" edc:desc="Watchdog Timer Period Select bits" edc:mask="0x1" edc:name="WDTPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS" edc:desc="Watchdog Timer Period Select bits" edc:mask="0x1f" edc:name="WDTPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="-nnnn-nn" edc:cname="OSCCON" edc:desc="Oscillator Control Register" edc:impl="0x7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0111-00" edc:name="OSCCON" edc:nzwidth="0x8" edc:por="-0111-00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCS0" edc:desc="System clock select bit" edc:mask="0x1" edc:name="SCS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCS1" edc:desc="System clock select bit" edc:mask="0x1" edc:name="SCS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IRCF0" edc:desc="Internal Oscillator Frequency Select bits" edc:mask="0x1" edc:name="IRCF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRCF1" edc:desc="Internal Oscillator Frequency Select bits" edc:mask="0x1" edc:name="IRCF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRCF2" edc:desc="Internal Oscillator Frequency Select bits" edc:mask="0x1" edc:name="IRCF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRCF3" edc:desc="Internal Oscillator Frequency Select bits" edc:mask="0x1" edc:name="IRCF3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SCS" edc:desc="System clock select bit" edc:mask="0x3" edc:name="SCS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IRCF" edc:desc="Internal Oscillator Frequency Select bits" edc:mask="0xf" edc:name="IRCF" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nn--nn" edc:cname="OSCSTAT" edc:desc="Oscillator Status Register" edc:impl="0x13" edc:isindirect="false" edc:isvolatile="true" edc:mclr="q-qq--0q" edc:name="OSCSTAT" edc:nzwidth="0x8" edc:por="0-q0--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HFIOFS" edc:desc="Low Freqency Internal Oscillator Ready bit" edc:mask="0x1" edc:name="HFIOFS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LFIOFR" edc:desc="Low Freqency Internal Oscillator Ready bit" edc:mask="0x1" edc:name="LFIOFR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="HFIOFR" edc:desc="High Freqency Internal Oscillator Ready bit" edc:mask="0x1" edc:name="HFIOFR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OSTS" edc:desc="Oscillator Start-up Time-out Status bit" edc:mask="0x1" edc:name="OSTS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T1OSCR" edc:desc="Timer1 Oscillator Ready bit" edc:mask="0x1" edc:name="T1OSCR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
